
&НаКлиенте
Процедура ПутьКБазеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.ПолноеИмяФайла = "";
	//Текст = "ru=""xml""; en=""xml""";
	//Фильтр = НСтр(Текст)+"(*.xml)|*.xml";
	//Диалог.Фильтр = Фильтр;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите файл";
	Если Диалог.Выбрать() Тогда
		МассивФайлов = Диалог.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			ПутьКБазе = ИмяФайла;
			
			Прервать;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
    
    СохранитьНастройки(Отказ, СтандартнаяОбработка);
	
КонецПроцедуры


&НаСервере
Процедура СохранитьНастройки(Отказ, СтандартнаяОбработка) Экспорт
    Настройки = Новый Соответствие;
    Настройки.Вставить("DealsViewerSQLiteDB", ПутьКБазе);
	
	ХранилищеПользовательскихНастроекОтчетов.Сохранить("ВнешняяОбработка.DealsViewer","НастройкиБД",Настройки);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПутьКБазе") Тогда
		ПутьКБазе = Параметры.ПутьКБазе;
	КонецЕсли;
	
КонецПроцедуры
